Imporved Role Based Access Control and major bug fixes
